# St7DeleteUnusedNodes

Deletes nodes that are not referenced by the connectivity of any element.

long St7DeleteUnusedNodes(long uID, long* NumDeleted)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
NumDeleted
Number of unused nodes deleted.